---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator
source: html/222339c6-d45c-ca08-433e-fe327b17ac47.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator

An iterator to a wire material type set.

## Syntax (C#)
```csharp
public abstract class WireMaterialTypeSetIterator : APIObject,
	IEnumerator
```